[
    {
        "description": "Владелец ранчо пытается сохранить землю своих предков. Кевин Костнер в неовестерне от автора «Ветреной реки»",
        "rating": 8.6,
        "id": 1,
        "trailer": "https://www.youtube.com/watch?v=UKei_d0cbP4",
        "genre_id": 17,
        "director": "Тейлор Шеридан",
        "director_id": 1,
        "title": "Йеллоустоун",
        "genre": "Вестерн",
        "year": 2018
    },
    {
        "description": "США после Гражданской войны. Легендарный охотник за головами Джон Рут по кличке Вешатель конвоирует заключенную. По пути к ним прибиваются еще несколько путешественников. Снежная буря вынуждает компанию искать укрытие в лавке на отшибе, где уже расположилось весьма пестрое общество: генерал конфедератов, мексиканец, ковбой… И один из них - не тот, за кого себя выдает.",
        "rating": 7.8,
        "id": 2,
        "trailer": "https://www.youtube.com/watch?v=lmB9VWm0okU",
        "genre_id": 4,
        "director": "Квентин Тарантино",
        "director_id": 2,
        "title": "Омерзительная восьмерка",
        "genre": "Драма",
        "year": 2015
    },
    {
        "description": "События происходят в конце XIX века на Диком Западе, в Америке. В основе сюжета — сложные перипетии жизни работяги — старателя Габриэля Конроя. Найдя нефть на своем участке, он познает и счастье, и разочарование, и опасность, и отчаяние...",
        "rating": 6.0,
        "id": 3,
        "trailer": "https://www.youtube.com/watch?v=hLA5631F-jo",
        "genre_id": 17,
        "director": "Владимир Вайншток",
        "director_id": 3,
        "title": "Вооружен и очень опасен",
        "genre": "Вестерн",
        "year": 1978
    },
    {
        "description": "Эксцентричный охотник за головами, также известный как Дантист, промышляет отстрелом самых опасных преступников. Работенка пыльная, и без надежного помощника ему не обойтись. Но как найти такого и желательно не очень дорогого? Освобождённый им раб по имени Джанго – прекрасная кандидатура. Правда, у нового помощника свои мотивы – кое с чем надо сперва разобраться.",
        "rating": 8.4,
        "id": 4,
        "trailer": "https://www.youtube.com/watch?v=2Dty-zwcPv4",
        "genre_id": 17,
        "director": "Квентин Тарантино",
        "director_id": 2,
        "title": "Джанго освобожденный",
        "genre": "Вестерн",
        "year": 2012
    },
    {
        "description": "История превращения застенчивого парня Реджинальда Дуайта, талантливого музыканта из маленького городка, в суперзвезду и культовую фигуру мировой поп-музыки Элтона Джона.",
        "rating": 7.3,
        "id": 5,
        "trailer": "https://youtu.be/VISiqVeKTq8",
        "genre_id": 18,
        "director": "Декстер Флетчер",
        "director_id": 4,
        "title": "Рокетмен",
        "genre": "Мюзикл",
        "year": 2019
    },
    {
        "description": "Али - молодая амбициозная девушка из маленького городка с чудесным голосом, совсем недавно потеряла своих родителей. Теперь никому не нужная, она отправляется в большой город Лос-Анджелес, где устраивается на работу у Тесс, хозяйки ночного клуба «Бурлеск». За короткое время она находит друзей, поклонников и любовь всей своей жизни. Но может ли сказка длиться вечно? Ведь немало людей завидует этой прекрасной танцовщице...",
        "rating": 6.4,
        "id": 6,
        "trailer": "https://www.youtube.com/watch?v=sgOhxneHkiE",
        "genre_id": 18,
        "director": "Стив Энтин",
        "director_id": 5,
        "title": "Бурлеск",
        "genre": "Мюзикл",
        "year": 2010
    },
    {
        "description": "Рокси Харт мечтает о песнях и танцах и о том, как сравняться с самой Велмой Келли, примадонной водевиля. И Рокси действительно оказывается с Велмой в одном положении, когда несколько очень неправильных шагов приводят обеих на скамью подсудимых.",
        "rating": 7.2,
        "id": 7,
        "trailer": "https://www.youtube.com/watch?v=YxzS_LzWdG8",
        "genre_id": 18,
        "director": "Роб Маршалл",
        "director_id": 6,
        "title": "Чикаго",
        "genre": "Мюзикл",
        "year": 2002
    },
    {
        "description": "Париж, 1899 год. Знаменитый ночной клуб «Мулен Руж» — это не только дискотека и шикарный бордель, но и место, где, повинуясь неудержимому желанию прочувствовать атмосферу праздника, собираются страждущие приобщиться к красоте, свободе, любви и готовые платить за это наличными.",
        "rating": 7.6,
        "id": 8,
        "trailer": "https://www.youtube.com/watch?v=lpiMCTd87gE",
        "genre_id": 18,
        "director": "Баз Лурман",
        "director_id": 7,
        "title": "Мулен Руж",
        "genre": "Мюзикл",
        "year": 2001
    },
    {
        "description": "Эндрю мечтает стать великим. Казалось бы, вот-вот его мечта осуществится. Юношу замечает настоящий гений, дирижер лучшего в стране оркестра. Желание Эндрю добиться успеха быстро становится одержимостью, а безжалостный наставник продолжает подталкивать его все дальше и дальше – за пределы человеческих возможностей. Кто выйдет победителем из этой схватки?",
        "rating": 8.5,
        "id": 9,
        "trailer": "https://www.youtube.com/watch?v=Q9PxDPOo1jw",
        "genre_id": 4,
        "director": "Дэмьен Шазелл",
        "director_id": 8,
        "title": "Одержимость",
        "genre": "Драма",
        "year": 2013
    },
    {
        "description": "Авторитетный взгляд на историю культового электронного стиля глазами самых известных его представителей и последователей. Увлекательный рассказ о феномене итало-диско и возможность увидеть своими глазами, что творилось на главных танцполах 80-х.",
        "rating": 0.0,
        "id": 10,
        "trailer": "https://www.youtube.com/watch?v=LVdRR6m5OdQ",
        "genre_id": 9,
        "director": "Пьетро Антон",
        "director_id": 9,
        "title": "Наследие итало-диско",
        "genre": "Документальное",
        "year": 2017
    },
    {
        "description": "Юность певца Джонни Кэша была омрачена гибелью его брата и пренебрежительным отношением отца. Военную службу будущий певец проходил в Германии. После свадьбы и рождения дочери он выпустил свой первый хит и вскоре отправился в турне по США вместе с Джерри Ли Льюисом, Элвисом Пресли и Джун Картер, о которой он безнадёжно мечтал целых десять лет.",
        "rating": 7.8,
        "id": 11,
        "trailer": "https://www.youtube.com/watch?v=RnFrrzg1OEQ",
        "genre_id": 4,
        "director": "Джеймс Мэнголд",
        "director_id": 10,
        "title": "Переступить черту",
        "genre": "Драма",
        "year": 2005
    },
    {
        "description": "Наследник знаменитого дома Атрейдесов Пол отправляется вместе с семьей на одну из самых опасных планет во Вселенной — Арракис. Здесь нет ничего, кроме песка, палящего солнца, гигантских чудовищ и основной причины межгалактических конфликтов — невероятно ценного ресурса, который называется меланж. В результате захвата власти Пол вынужден бежать и скрываться, и это становится началом его эпического путешествия. Враждебный мир Арракиса приготовил для него множество тяжелых испытаний, но только тот, кто готов взглянуть в глаза своему страху, достоин стать избранным.",
        "rating": 8.4,
        "id": 12,
        "trailer": "https://www.youtube.com/watch?v=DOlTmIhEsg0",
        "genre_id": 7,
        "director": "Дени Вильнёв",
        "director_id": 11,
        "title": "Дюна",
        "genre": "Фантастика",
        "year": 2021
    },
    {
        "description": "Это история любви старлетки, которая между прослушиваниями подает кофе состоявшимся кинозвездам, и фанатичного джазового музыканта, вынужденного подрабатывать в заштатных барах. Но пришедший к влюбленным успех начинает подтачивать их отношения.",
        "rating": 8.0,
        "id": 13,
        "trailer": "https://www.youtube.com/watch?v=lneNCBIXD4I",
        "genre_id": 18,
        "director": "Дэмьен Шазелл",
        "director_id": 8,
        "title": "Ла-Ла Ленд",
        "genre": "Мюзикл",
        "year": 2016
    },
    {
        "description": "Рассказ о начале творческого пути Виктора Цоя и группы «Кино», о его взаимоотношениях с Майком Науменко, его женой Натальей и многими, кто был в авангарде рок-движения Ленинграда 1981 года.",
        "rating": 7.3,
        "id": 14,
        "trailer": "https://www.youtube.com/watch?v=TvAbtsQKrHA",
        "genre_id": 4,
        "director": "Кирилл Серебренников",
        "director_id": 12,
        "title": "Лето",
        "genre": "Драма",
        "year": 2018
    },
    {
        "description": "Джек Торренс с женой и сыном приезжает в элегантный отдалённый отель, чтобы работать смотрителем во время мертвого сезона. Торренс здесь раньше никогда не бывал. Или это не совсем так? Ответ лежит во мраке, сотканном из преступного кошмара.",
        "rating": 8.4,
        "id": 15,
        "trailer": "https://www.youtube.com/watch?v=NMSUEhDWXH0",
        "genre_id": 6,
        "director": "Стэнли Кубрик",
        "director_id": 14,
        "title": "Сияние ",
        "genre": "Триллер",
        "year": 1980
    },
    {
        "description": "Что если в один прекрасный день в тебя вселяется существо-симбиот, которое наделяет тебя сверхчеловеческими способностями? Вот только Веном – симбиот совсем недобрый, и договориться с ним невозможно. Хотя нужно ли договариваться?.. Ведь в какой-то момент ты понимаешь, что быть плохим вовсе не так уж и плохо. Так даже веселее. В мире и так слишком много супергероев! Мы – Веном!",
        "rating": 6.7,
        "id": 16,
        "trailer": "https://www.youtube.com/watch?v=n7GlLxV_Igk",
        "genre_id": 7,
        "director": "Рубен Фляйшер",
        "director_id": 13,
        "title": "Веном",
        "genre": "Фантастика",
        "year": 2018
    },
    {
        "description": "К своим 16 годам старшеклассник Донни уже знает, что такое смерть. После несчастного случая, едва не стоившего ему жизни, Донни открывает в себе способности изменять время и судьбу. Произошедшие с ним перемены пугают его окружение — родителей, сестер, учителей, друзей и любимую девушку.",
        "rating": 8.0,
        "id": 17,
        "trailer": "https://www.youtube.com/watch?v=9H_t5cdszFU",
        "genre_id": 7,
        "director": "Ричард Келли",
        "director_id": 15,
        "title": "Донни Дарко",
        "genre": "Фантастика",
        "year": 2001
    },
    {
        "description": "Уже немолодой школьный учитель музыки Джо Гарднер всю жизнь мечтал выступать на сцене в составе джазового ансамбля. Однажды он успешно проходит прослушивание у легендарной саксофонистки и, возвращаясь домой вне себя от счастья, падает в люк и умирает. Теперь у Джо одна дорога — в Великое После, но он сбегает с идущего в вечность эскалатора и случайно попадает в Великое До. Тут новенькие души обретают себя, и у будущих людей зарождаются увлечения, мечты и интересы. Джо становится наставником упрямой души 22, которая уже много веков не может найти свою искру и отправиться на Землю.",
        "rating": 8.1,
        "id": 18,
        "trailer": "https://www.youtube.com/watch?v=vsb8762mE6Q",
        "genre_id": 16,
        "director": "Пит Доктер",
        "director_id": 16,
        "title": "Душа",
        "genre": "Мультфильм",
        "year": 2020
    },
    {
        "description": "Париж. 1910 год. Ужасный монстр, напоминающий гигантское насекомое, нагоняет страх на всю Францию. Застенчивый киномеханик и неутомимый изобретатель начинают охоту на него. В этой погоне они знакомятся со звездой кабаре, сумасшедшим ученым и его умной обезьянкой и, наконец, самим монстром, который оказывается совсем не страшным. Теперь безобидное, как блоха, чудовище ищет у своих новых друзей защиты от вредного начальника городской полиции.",
        "rating": 6.1,
        "id": 19,
        "trailer": "https://www.youtube.com/watch?v=rKsdTuvrF5w",
        "genre_id": 16,
        "director": "Бибо Бержерон",
        "director_id": 18,
        "title": "Монстр в Париже",
        "genre": "Мультфильм",
        "year": 2010
    },
    {
        "description": "От Великого потопа зверей спас ковчег. Но спустя полгода скитаний они готовы сбежать с него куда угодно. Нервы на пределе. Хищники готовы забыть про запреты и заглядываются на травоядных. Единственное спасение — найти райский остров. Там простор и полно еды. Но даже если он совсем близко, будут ли рады местные такому количеству гостей?",
        "rating": 5.9,
        "id": 20,
        "trailer": "https://www.youtube.com/watch?v=Qjpmysz4x-4",
        "genre_id": 16,
        "director": "Тоби Генкель",
        "director_id": 19,
        "title": "Упс... Приплыли!",
        "genre": "Мультфильм",
        "year": 2020
    },
    {
        "description": "Сперва они пришли за коровами, а теперь хотят ТЕБЯ! Спасайся кто может, не забудь укулеле. А еще барабульку, дада!",
        "rating": 6.4,
        "id": 21,
        "trailer": "https://www.youtube.com/watch?v=DqtjHWlM4lQ",
        "genre_id": 1,
        "director": "Тим Бёртон",
        "director_id": 21,
        "title": "Марс Атакует!",
        "genre": "Комедия",
        "year": 1996
    },
    {
        "description": "Невеста умерла, но это только начало, и скоро начнется лютая заварушка, берегись кто может, а кто не может - уноси ноги!",
        "rating": 7.3,
        "id": 22,
        "trailer": "https://www.youtube.com/watch?v=AGACeWVdFqo",
        "genre_id": 16,
        "director": "Тим Бёртон",
        "director_id": 21,
        "title": "Труп Невесты",
        "genre": "Мультфильм",
        "year": 2005
    }
]